#include <stdio.h>

void main()
{		
	printf("문자열 출력 : [%-20s]\n", "대한민국");
	printf("문자열 출력 : [%20s]\n", "대한민국");
	printf("문자 출력 : [%10c]\n", 'a');
	printf("문자 정수값 출력 : [%-10d]\n", 'a');
	printf("오른쪽 정렬 : [%10d]\n", 1234);
	printf("0 삽입 : [%010d]\n", 1234);
	printf("음수의 0 삽입 : [%010d]\n", -1234);
	printf("부동소수점 출력 : [%8.2f]\n", 123.4567);
	printf("부동소수점 출력 : [%-8.2f]\n", 123.4567);
	printf("부동소수점 출력 : [%10.2f]\n", 0.0012345);
	printf("부동소수점 출력 : [%10.3e]\n", 0.0012345);
	printf("부동소수점 출력 : [%10.7g]\n", 0.00012345);
}